{"newspapers": {"cnn": {"link": "http://edition.cnn.com/", "articles": [{"title": "How to Watch VR", "text": "IN YOUR HEADSET...\n\nHeadsets are hands-down the best way to watch VR stories. You can see the latest from CNNVR on the Samsung VR app , the Oculus Video app on Rift , or on the CNNVR app on Google Daydream . Just look left or right to explore the 360 world around you. Believe us, you need to try this.", "link": "http://edition.cnn.com/2017/03/04/vr/how-to-watch-vr", "published": "2017-03-04T00:00:00"}, {"title": "'The Handmaid's Tale' feels the weight of its timeliness", "text": "(CNN) \"The Handmaid's Tale\" isn't the best TV show ever, although it's plenty good. But it's hard to think of a series that has been better calibrated to tap into the zeitgeist and unease of its cultural and political moment.\n\nThe Hulu series returns for its third season this week, making another trip to the dystopian land of Gilead, where women live under patriarchal domination, with some used as little more than breeding stock for their overlords.\n\nWithout giving too much away, the new episodes feature a nascent resistance, pluckily operating under the noses of their oppressive masters; and some particularly striking and iconic visual imagery in one of the later episodes previewed.\n\nNovelist Margaret Atwood created the underlying scenario in 1985, but the program -- an Emmy winner in its first season -- has become a powerful symbol , with the crimson cloaks that the handmaids are forced to wear showing up as a means of silent protest.\n\nPrevious seasons of \"The Handmaid's Tale\" coincided with, among other things, the birth of the #MeToo hashtag. The series comes back amid a push toward restrictive anti-abortion laws, which have made the image of a society that seeks to control and coerce women, for many, feel less like the stuff of science fiction, and more a cautionary tale.\n\nRead More", "link": "http://edition.cnn.com/2019/06/03/entertainment/the-handmaids-tale-column/index.html", "published": "2019-06-03T00:00:00"}, {"title": "Madonna will perform at World Pride in New York City", "text": "(CNN) Madonna has confirmed rumors she will perform at World Pride in New York City later this month.\n\nFollowing months of speculation, the singer said Monday on NBC's \"Today\" show that she'll perform at Pride Island, the festival's live music event, on June 30.\n\n\"I hear you,\" she said -- wrapped in a rainbow towel -- in a video posted Monday on her official Instagram account. \"I'll be on Pride Island, where I was born.\"\n\nGrace Jones is also set to headline the two-day event, which falls on the last weekend in June and marks the 50th anniversary of the 1969 Stonewall uprising in New York, a major milestone in the gay-rights movement.. The entire month is LGBTQ Pride Month in New York City.\n\nMadonna's advocacy for LGBTQ people goes back decades. She recently teased a new song, \"I Rise,\" ahead of her upcoming album , \"Madame X,\" which will be released June 14.\n\nRead More", "link": "http://edition.cnn.com/2019/06/03/entertainment/madonna-new-york-city-pride-month-finale/index.html", "published": "2019-06-03T00:00:00"}]}, "bbc": {"rss": "http://feeds.bbci.co.uk/news/rss.xml", "link": "http://www.bbc.com/", "articles": [{"link": "https://www.bbc.co.uk/news/uk-48491722", "published": "2019-06-03T19:52:35", "title": "Donald Trump meets Queen at start of UK state visit", "text": "Media playback is unsupported on your device Media caption Trump shakes the Queen's hand\n\nUS President Donald Trump and First Lady Melania Trump have met the Queen on the first day of their state visit to the UK.\n\nThe pair went to Buckingham Palace for a welcome ceremony and private lunch.\n\nMr and Mrs Trump laid a wreath at the tomb of the unknown warrior in Westminster Abbey and are due to attend a state banquet this evening.\n\nTweeting ahead of the banquet, Mr Trump said the \"London part of the trip\" was going \"really well\".\n\nHe added the \"entire Royal Family\" had been \"fantastic\" and the relationship with the US-UK was \"very strong\".\n\nA \"big trade deal is possible\" once the UK removes the \"shackles\", the president said, adding: \"Already starting to talk!\"\n\nEarlier in the day, Mr Trump criticised the Mayor of London, with whom he has clashed in the past.\n\nHe tweeted that Sadiq Khan - who had earlier said the UK should \"not roll out the red carpet\" for Mr Trump - was a \"stone cold loser\", but the president added he was looking forward to his visit.\n\nSkip Twitter post by @realDonaldTrump London part of trip is going really well. The Queen and the entire Royal family have been fantastic. The relationship with the United Kingdom is very strong. Tremendous crowds of well wishers and people that love our Country. Haven’t seen any protests yet, but I’m sure the.... — Donald J. Trump (@realDonaldTrump) June 3, 2019 Report\n\nSkip Twitter post 2 by @realDonaldTrump ....Fake News will be working hard to find them. Great love all around. Also, big Trade Deal is possible once U.K. gets rid of the shackles. Already starting to talk! — Donald J. Trump (@realDonaldTrump) June 3, 2019 Report\n\nMr and Mrs Trump arrived on Air Force One earlier on Monday and were taken to the US ambassador's home in central London, where they are staying, before travelling to Buckingham Palace.\n\nProtests are planned in several UK cities during the three-day visit, including in London, Manchester, Belfast, and Birmingham.\n\nLabour leader Jeremy Corbyn - who is boycotting the state dinner - is due to attend and speak at the London demonstration, a party spokesman has confirmed.\n\nEarlier, Mr Corbyn tweeted: \"Tomorrow's protest against Donald Trump's state visit is an opportunity to stand in solidarity with those he's attacked in America, around the world and in our own country - including, just this morning, Sadiq Khan.\"\n\nMedia playback is unsupported on your device Media caption Mr and Mrs Trump laid a wreath at the grave of the unknown warrior as part of their UK state visit\n\nTalks between Mr Trump and outgoing Prime Minister Theresa May will begin on Tuesday, with the pair expected to discuss climate change and Chinese technology firm Huawei.\n\nThe president's visit coincides with the commemorations for the 75th anniversary of the D-Day landings, which the Queen, Mr Trump and other heads of state will attend at Portsmouth on Wednesday.\n\nImage copyright Reuters Image caption The Marine One helicopter landed in the grounds of Buckingham Palace\n\nImage copyright Getty Images Image caption Mr Trump was greeted from the helicopter by Prince Charles\n\nCrowds were gathered outside Buckingham Palace as the president and first lady landed by helicopter shortly after midday.\n\nThe Queen presented Mr Trump with a first edition of Sir Winston Churchill's book The Second World War, from 1959, with gilt decorations and hand-sewn bindings in the colours of the US flag. He was also given a three-piece Duofold pen set decorated with an EIIR emblem, in a design made exclusively for the monarch.\n\nMrs Trump received a specially commissioned silver box with a handcrafted enamel lid, decorated in royal blue with roses, thistles and shamrocks to represent the ceiling of Buckingham Palace's music room.\n\nAfter the private lunch, the Queen showed the couple American artefacts and other items from the Royal Collection. In a nod to the US leader's Scottish heritage, he was shown a bolt of Harris tweed.\n\nMr and Mrs Trump met the Duke of York at Westminster Abbey, where they laid a wreath at the grave of the unknown warrior. The president signed the distinguished visitor's book in his customary black marker pen, describing the 13th Century church as a \"special place\".\n\nTheir next stop was Clarence House, where they joined Prince Charles and the Duchess of Cornwall for tea.\n\nImage copyright PA Image caption The Prince of Wales and the Duchess of Cornwall posed with their visitors in the morning room at Clarence House\n\nImage copyright PA Image caption The royals hosted a private lunch for Mr Trump before further engagements this afternoon\n\nImage copyright Getty Images Image caption Mr Trump's daughter - and White House adviser - Ivanka Trump looks out of the window at Buckingham Palace\n\nLater, the Queen will host a state banquet at Buckingham Palace, also attended by the Duke and Duchess of Cambridge.\n\nThe Duchess of Sussex will not attend following the birth of her son Archie, who is less than a month old. On Sunday, Mr Trump denied calling the duchess \"nasty\", despite him using the word on tape.\n\nAs he stepped onto UK soil, Mr Trump was greeted by US Ambassador to the UK Woody Johnson and Foreign Secretary Jeremy Hunt.\n\nTory leadership candidate Mr Hunt, who has spoken about the importance of the UK's relationship with the US, said Mr Trump mentioned to him \"some of his very strong views about the Mayor of London\" which he had also tweeted.\n\nImage copyright Getty Images Image caption The American national anthem was played and Mr Trump was invited to inspect the guard of honour\n\nImage copyright Getty Images Image caption The US president made his mark in the distinguished visitors' book at Westminster Abbey\n\nImage copyright AFP Image caption The Queen showed US items of the Royal Collection to the president and first lady\n\nAnalysis\n\nBy James Landale, BBC diplomatic correspondent\n\nThe contrast could not have been starker. The President of the United States received a warm welcome from the Queen and the Prince of Wales at Buckingham Palace.\n\nThere were two 41-gun salutes - one for Mr Trump and another marking the 66th anniversary of the Queen's coronation on Sunday - as well as an honour guard of young Grenadiers resplendent in scarlet.\n\nAt the same time, Mr Trump launched a verbal attack on the mayor of the city in which he is now a guest, calling Sadiq Khan \"a stone cold loser\" for questioning why the President had been granted a state visit.\n\nIn truth, this is all of a piece for Mr Trump: he gets the pictures and the pageantry that he wants and will look good in his re-election campaign next year, and he gets to pick a fight with a liberal, Muslim politician that will play well with his base.\n\nAlready this row is forcing those campaigning to be Britain's prime minister to define themselves against Mr Trump.\n\nForeign Secretary Jeremy Hunt criticised Mr Khan for his \"great discourtesy\". But Health Secretary Matt Hancock said the office of the Mayor of London should be respected in the same way one respects the office of the president.\n\nThis visit has only just begun and already the Great Disruptor is tweeting angry thoughts and breaching diplomatic niceties. Business as usual, you might think - only today he also happens to be a guest of the Queen, who rarely tweets and is always diplomatic.\n\nMr Trump's tweet accused Mr Khan of doing a \"terrible job\" as mayor, adding: \"[He] has been foolishly \"nasty\" to the visiting president of the United States, by far the most important ally of the United Kingdom. He is a stone cold loser who should focus on crime in London, not me.\"\n\nA spokesman for Mr Khan said \"childish insults\" should be beneath the US president, adding: \"Sadiq is representing the progressive values of London and our country, warning that Donald Trump is the most egregious example of a growing far-right threat around the globe.\"\n\nMr Khan was not the only target of the president's tweets. Mr Trump also criticised CNN, complaining that it was the primary source of news from the US on his trip - but that he had to turn off its \"fake news\" after a short while.\n\nChina, which is in an ongoing trade dispute with the US, also came under fire. Mr Trump claimed that companies are leaving China in order to avoid paying the tariffs and that the US is \"taking billions\".\n\nMedia playback is unsupported on your device Media caption The moment Trump lands for UK state visit\n\nAlthough Mr Trump has spoken of his admiration for Mrs May, there are expected to be differences of opinion during their talks, which begin on Tuesday.\n\nThe prime minister will raise the issue of climate change, with a government spokesman again saying on Monday the UK was \"disappointed by the US decision to withdraw from the Paris Agreement in 2017\".\n\nThe two leaders are also expected to discuss Huawei. The US has blacklisted the Chinese firm for security reasons, while the UK may allow it to supply \"non-core\" components for its 5G network.\n\nImage copyright Getty Images Image caption Foreign Secretary Jeremy Hunt was among those waiting to greet Mr Trump\n\nImage copyright EPA Image caption Airmen from the RAF Regiment formed a guard of honour for the couple\n\nImage copyright PA Image caption Items were unloaded from the president's plane, by a team different from Stansted Airport's usual baggage handlers\n\nImage copyright Reuters Image caption After landing, Mr Trump headed to Winfield House in Regent's Park, the US ambassador's residence\n\nBefore the visit, President Trump told the Sun newspaper he was backing Conservative Party leadership contender Boris Johnson to be the next UK prime minister.\n\nHe also told the Sunday Times that Brexit Party leader Nigel Farage - an arch critic of Mrs May - should be involved in the government's negotiations to leave the EU.\n\nAt Monday evening's Buckingham Palace banquet, both the president and the Queen are expected to make a speech to guests, who will include prominent Americans living in Britain.\n\nMr Corbyn, House of Commons Speaker John Bercow, and Liberal Democrat leader Sir Vince Cable are all boycotting the state banquet.\n\nFans and critics outside Buckingham Palace\n\nBy Hamish Mackay, BBC News\n\nA quick walk around the crowd outside Buckingham Palace revealed the presence of supporters and detractors of Mr Trump - both equally strong in their views.\n\nPhillip Butah, from Essex, wearing a MAGA hat and describing himself and his companion as \"Trump activists\", says: \"We are so happy that he's here - this visit is long overdue.\"\n\nAsked what they expect the UK to get from this visit, they reply: \"Trade deals.\"\n\nCorey Wright, a 25-year-old American from Ohio, in London as a tourist, sees the visit in a similar light.\n\n\"I think the visit is good for the political environment,\" he says. \"I think that needs to be worked on and that's what he's here to do.\"\n\nAuriel Granville - a climate activist from Wimbledon, south-west London - came dressed as the Statue of Liberty to protest against the president's visit.\n\n\"I don't think he should be received in this way - climate change should be top of our agenda and Donald Trump is a climate change denier,\" she said.\n\nRead more about the crowds outside the palace\n\nThe Royal Family twitter account posted a picture of the preparations for the 170 guests at the state banquet in Buckingham Palace ballroom.\n\nOn Tuesday morning, President Trump and Mrs May will host a business breakfast at St James's Palace.\n\nPresident Trump will then visit Downing Street for further talks with Mrs May, followed by a joint press conference.\n\nImage copyright Reuters Image caption President Donald Trump met Prime Minister Theresa May at Chequers last July\n\nProtesters are organising a \"national demonstration\" which will start at Trafalgar Square at 11:00 on Tuesday.\n\nThe Met Police said it had \"a very experienced command team\" leading the operation to deal with the visit.\n\nThe police operation for the president's visit last year was estimated to have cost nearly £18m.\n\nMedia playback is unsupported on your device Media caption The BBC's Jonny Dymond on what to expect from President Trump's visit to the UK\n\nAlthough the Queen has met 12 of the 13 US presidents who have been in office during her reign, Mr Trump's state visit to the UK is only the third by a US leader.\n\nGeorge W Bush and Barack Obama are the only other US presidents to have been given a state visit.\n\nState visits differ from official visits and are normally at the invitation of the Queen, who acts on advice from the government. The Queen usually receives one or two heads of state per year and has hosted 112 of these visits since becoming monarch in 1952."}, {"link": "https://www.bbc.co.uk/news/world-asia-india-48499548", "published": "2019-06-03T17:44:54", "title": "Nanda Devi: Bodies spotted in hunt for climbers missing in India", "text": "Media playback is unsupported on your device Media caption The four survivors were assessed in hospital before helping with the search\n\nA helicopter crew searching for eight climbers who went missing in the Indian Himalayas has spotted five bodies, Indian officials say.\n\nFour Britons, two Americans, an Australian and an Indian made up the missing climbers, who disappeared on India's second highest-peak.\n\nNanda Devi was believed to have been hit by multiple avalanches.\n\nA source told AFP news agency the bodies were seen on the same route as the climbers had taken.\n\nAuthorities are trying to assess how to retrieve the bodies from treacherous terrain where helicopters cannot land, says the BBC's Yogita Limaye in the state of Uttarakhand.\n\nImage copyright Reuters Image caption The 12 climbers pictured before they began their ascent\n\nThe missing climbers have not been heard from since 26 May, a day before an avalanche hit the 7,816-metre mountain.\n\nFour other climbers who were part of the group ascending the peak were rescued on Sunday and have since been assisting rescue efforts.\n\nThey had turned back early because of the bad weather, and were the last ones in contact with the larger group.\n\nWho are the missing?\n\nThe missing group was being led by experienced British mountain guide Martin Moran, whose Scotland-based company, Moran Mountain, has run numerous expeditions in the Indian Himalayas.\n\nThe rest of the group have been named as John McLaren, Rupert Whewell and University of York lecturer Dr Richard Payne from the UK; US nationals Anthony Sudekum and Ronald Beimel; Australian Ruth McCance and Indian guide Chetan Pandey.\n\n\"Four bodies can be seen together and a fifth slightly away from the others,\" a senior official for the nearby Pithoragarh region told Reuters news agency.\n\nRescue workers are now operating on the assumption all eight climbers have been killed, Vijay Kumar Jogdande said, adding that they expected to find the three other bodies nearby.\n\nThe family of Rupert Whewell says he is a very experienced climber and \"the ice and rocks is where he is happiest\".\n\nMeanwhile, a spokesperson for York University said staff and students there were \"extremely concerned\" for Dr Payne's safety.\n\nMartin Moran's family earlier said they were \"deeply saddened by the tragic events\".\n\nWhat about the survivors?\n\nThe four rescued climbers were named as Mark Thomas, 44, Ian Wade, 45, Kate Armstrong, 39, and Zachary Quain, 32.\n\nThey had been airlifted to safety after being spotted early on Sunday at Munsiyari base camp near Nanda Devi.\n\nImage copyright Getty Images Image caption The international group of climbers has not been heard from since 26 May\n\nInformation they provided after their rescue helped to narrow the search area to about 50 sq km (20 sq miles).\n\n\"Even if we airdrop someone, he will need at least six to eight days to acclimatise before he can undertake any rescue mission,\" Vivek Kumar Pandey, a spokesperson for the Indo-Tibetan Border Police, told AFP.\n\nNanda Devi is the world's 23rd highest mountain and was first scaled in 1936.\n\nConsidered one of the toughest Himalayan peaks to climb, it attracts fewer climbers than other mountains in the region."}, {"link": "https://www.bbc.co.uk/news/health-48496652", "published": "2019-06-03T16:00:39", "title": "He Jiankui: Baby gene experiment 'foolish and dangerous'", "text": "Image copyright Jiankui He\n\nThe first people to be gene-edited - a pair of baby twin girls - may have been mutated in a way that shortens life expectancy, research suggests.\n\nProf He Jiankui shocked the world when he genetically altered the twins to try to give them protection against HIV.\n\nBut a study in Nature Medicine shows people who naturally have the mutation he was trying to recreate were significantly more likely to die young.\n\nExperts said Prof He's actions were \"very dangerous\" and \"foolish\".\n\nWhat was Prof He trying to do?\n\nProf He was targeting a gene called CCR5.\n\nIt is a set of genetic instructions that are important for how the immune system functions.\n\nHowever, they are also the doorway that human immunodeficiency virus (HIV) walks through to infect cells.\n\nMutations to CCR5 essentially lock the door and give people resistance to HIV.\n\nSo, Prof He made embryos in an IVF clinic and then used gene-editing technologies on them to alter the CCR5 gene.\n\nThe resulting girls - known as Lulu and Nana - were born last year.\n\nImage copyright Getty Images Image caption The human immunodeficiency virus uses CCR5 to gain entry into cells\n\nWhat does this have to do with life expectancy?\n\nThe problem is CCR5 has a bigger role in the body than just making people vulnerable to HIV.\n\nIt is active in the brain and in fighting off other infections, particularly flu.\n\nThe study, at the University of California, Berkeley, looked at nearly 410,000 people in the UK.\n\nIt showed those who had only the mutated version of CCR5 were 20% more likely to die before they turned 78.\n\n\"In this case, it is probably not a mutation that most people would want to have,\" said Prof Rasmus Nielsen, from UC Berkeley.\n\n\"You are actually, on average, worse off having it.\"\n\nFellow researcher Dr Xinzhu Wei said the gene-editing technology, known as Crispr, was still too risky to be using on children.\n\n\"The Crispr technology is far too dangerous to use right now for germ-line editing,\" she said.\n\nWhat does this mean for the twins?\n\nThe implications for Lulu and Nana are still unclear.\n\n\"It is impossible to predict if the mutations carried by the twin girls will have any effect,\" said Prof Robin Lovell-Badge, from the Francis Crick Institute.\n\nNot everyone who carried the mutations in the study died young but it was more likely.\n\nAnd life expectancy depends on a complex mix of the DNA you are born with and the world you live in.\n\nTo further complicate things, Prof He mutated CCR5 in a similar rather than identical way to people who have HIV resistance.\n\nProf Lovell-Badge said the study \"shows once more that He Jiankui was foolish to choose CCR5 to mutate\".\n\nWhat was the reaction to Prof He doing this?\n\nThere was universal condemnation by scientists when Prof He made the announcement in November.\n\nSome described the experiment as \"monstrous\".\n\nAnd he was criticised for experimenting when the risks to otherwise healthy children were unclear and for acting against Chinese law.\n\nThere was also anger because HIV can be treated and there was barely any risk of it being passed from the HIV-positive father to his children.\n\nThe Chinese authorities investigated and concluded that Prof He had acted illegally in pursuit of \"fame and fortune\".\n\nProf He has always defended his experiments and at a summit in Hong Kong said he was \"proud\" of his gene-editing work.\n\nFollow James on Twitter."}, {"link": "https://www.bbc.co.uk/news/uk-england-london-48499275", "published": "2019-06-03T14:18:54", "title": "Partner 'stabbed Britain's Got Talent nurse 70 times'", "text": "Image copyright NHS Press Office/PA Image caption Simonne Kerr joined the B Positive Choir following the death of her son Kavele\n\nA nurse who performed on Britain's Got Talent was killed by her partner who stabbed her more than 70 times and slashed her throat, a court has heard.\n\nSimonne Kerr, 31, was last seen heading to Desmond Sylva's flat in Clapham, south London, on 15 August last year.\n\nThe Old Bailey heard Mr Sylva called his brother at lunchtime that day to say he had killed his girlfriend before he alerted the emergency services.\n\nThe 41-year-old denies murder but has pleaded guilty to manslaughter.\n\nProsecutor Oliver Glasgow QC told the jury Ms Kerr \"did not stand a chance\" during the \"utterly terrifying attack\".\n\n\"Desmond Sylva had used a kitchen knife... and despite her efforts to fight him off, she was clearly powerless to do so,\" he said.\n\nImage copyright PA Image caption Ms Kerr was pronounced dead at the scene on 15 August last year\n\nIn a 999 call played in court, Mr Sylva said: \"Can I have police please? I've just committed a murder.\n\n\"I'm ex-Army and I've got lots of mental health issues.\"\n\nAsked why he had done it, he said: \"She's just [got] on my nerves, man, trying to fight me and take my money so I had to defend myself.\"\n\nMr Glasgow said Mr Sylva's depression \"neither explains nor justifies his actions\" and suggested he had simply \"lost his temper\".\n\nThe body of the Guy's and St Thomas's nurse was found lying beside a bed, wrapped in a blood-soaked duvet.\n\n\"The last few minutes of [Ms Kerr's] life must have been utterly terrifying: repeatedly stabbed by the man who was supposed to care for her but who in the end simply butchered her and then tried to blame her for what he had done,\" Mr Glasgow said.\n\n\"He chose to pick up a knife and he chose to use it again and again to stab Simonne Kerr at a time when he was not acting in lawful self-defence.\"\n\nImage copyright PA Image caption Ms Kerr was killed in an \"utterly terrifying attack\", the court heard\n\nJurors heard Mr Sylva had served in the Royal Regiment of Fusiliers between 2002 and 2012 before he was discharged on medical grounds.\n\nSince then he has been given treatment on a number of occasions and diagnosed with bipolar disorder, post-traumatic stress disorder and depression.\n\nThe court heard Mr Sylva had been briefly admitted to hospital after telling his mother he was feeling suicidal on 9 August last year, while the day before Ms Kerr's death he allegedly told his brother he was going to kill himself or someone else.\n\nMs Kerr joined the B Positive Choir after the death of her six-year-old son Kavele from complications of sickle cell disease.\n\nShe performed with the choir in last year's final of the ITV talent show, which was won by Lost Voice Guy.\n\nThe trial continues."}]}, "theguardian": {"rss": "https://www.theguardian.com/uk/rss", "link": "https://www.theguardian.com/international", "articles": [{"link": "https://www.theguardian.com/us-news/2019/jun/03/donald-trump-arrives-in-buckingham-palace-for-state-visit", "published": "2019-06-03T19:58:12", "title": "41-gun salutes and a Twitter tirade: Donald Trump arrives in UK", "text": "Donald Trump breezed into Britain by launching an attack on London’s mayor and berating so-called fake news before he landed on the Queen’s back lawn for the start of his controversial three-day state visit.\n\nShortly before Air Force One touched down at Stansted airport, the US president heralded his arrival with a Twitter tirade against old adversary Sadiq Khan, condemning the mayor as a “stone cold loser”, comments the mayor’s office later rebuffed as “childish insults”.\n\nQuick guide Trump's state visit: which family members are with him? Show Hide Travelling Trumps When Donald Trump and his wife, Melania, arrive for a state visit to the UK on 3 June, they will reportedly be joined by the president’s four adult children and their spouses. Here's who is in the family entourage: Ivanka Trump Ivanka is Trump’s oldest daughter and works in the White House (unpaid) as an adviser to the president. Trump has relied on her often for overseas diplomacy, including sitting in for him briefly at a G20 summit, and he said he had considered naming her to head the World Bank. She has visited Ethiopia and the Ivory Coast on behalf of the administration to promote women’s rights. Before her father’s presidency, Trump ran her own fashion line. Jared Kushner Trump’s son-in-law is a White House senior adviser and the administration’s envoy to the Middle East (also unpaid). With his wife Ivanka he has also been the subject of a host of controversies – with a whistleblower alleging they were granted sensitive security clearances over the objections of career security experts. He has also been accused of conflicts of interest over his family’s sprawling real-estate empire. Kushner wears many hats in Washington. He is supposed to come up with a Middle East peace plan, as well as US immigration policy. Donald Trump Jr Trump’s eldest son and his brother, Eric, run their father’s business empire while he is in the White House. Officially, Trump Jr is executive vice-president of the Trump Organization. It was Trump Jr who met a Russian lawyer in an infamous Trump Tower meeting in New York in 2016, after the Russian offered him election ‘dirt’ on the Democratic presidential candidate Hillary Clinton. Kushner also attended. Although accepting campaign help from foreign nationals is illegal, the special counsel Robert Mueller said after investigating that there was not enough evidence to prove meeting participants knew they were breaking the law. Trump Jr may be accompanied by his girlfriend, Kimberly Guilfoyle, a former Fox News host. Eric Trump Eric Trump is the co-leader of the Trump Organization during his father’s presidency. He has defended his father from accusations of racism, and called the president’s critics “not even people”. He is parodied on the weekly US satirical comedy TV show Saturday Night Live and elsewhere as the not-so-sharp Trump brother, though supporters call this portrayal inaccurate. Most recently, a watchdog group has been pressing to find out how much it cost taxpayers when Eric and members of one of the family’s golf clubs travelled to Scotland to play the links. Lara Trump Lara Trump is a campaign adviser to Donald Trump’s re-election campaign and wife to Eric. A vocal defender of her father-in-law, she recently made headlines by saying the decision to let in large numbers of migrants fleeing war- and poverty-torn countries for Europe was “one of the worst things that ever happened to Germany”.\n\nTiffany Trump Tiffany is the lowest profile of Trump’s adult children and his only child with second wife Marla Maples. She headed to London ahead of the rest of her family. The 25-year-old is a graduate student at Georgetown Law in Washington DC. She travelled to the Cannes film festival earlier this month with her wealthy boyfriend, in a trip that has drawn scrutiny over its cost to taxpayers in terms of security for the presidential daughter.\n\nHowever, by the time the president’s helicopter, Marine One, landed at Buckingham Palace for his long-desired ceremonial visit, he was wreathed in smiles, with his arrival marked by two 41-gun salutes, a guard of honour and a white-tie-and-tiara banquet.\n\nYes, it's me, President Trump. You can get off your knees now | John Crace Read more\n\nThere was even a wall: the high one that encloses Buckingham Palace gardens served to keep Trump, only the third US president to be honoured with a state visit, away from the public and protests. Security concerns meant there was no carriage ride, and therefore no risk of a repeat of the welcome accorded China’s president, Xi Jinping, who ran the gauntlet of mass protests along the Mall.\n\nMore than 250,000 protesters are expected to take to London’s streets in protests against Trump on Tuesday, when the Trump baby blimp is expected to appear once again. On Monday, as the Queen prepared to host Donald Trump for a state banquet, more than 100 protesters demonstrated outside the gates of Buckingham Palace against the US president being handed “the red-carpet treatment”.\n\nFacebook Twitter Pinterest Marine One arrives for the welcome ceremony at Buckingham Palace. Photograph: Niklas Halle’n/AFP/Getty Images\n\nThe Labour leader, Jeremy Corbyn, who will address the protesters in London on Tuesday, tweeted: “Tomorrow’s protest against Donald Trump’s state visit is an opportunity to stand in solidarity with those he’s attacked in America, around the world and in our own country – including, just this morning, @SadiqKhan”.\n\nThe state visit, which is the 113th hosted by the Queen, saw a meeting between two dynasties, one ancient, one fledgling, as Trump combined the official visit with a family jaunt.\n\nTrump’s daughter Ivanka and her husband, Jared Kushner, a presidential adviser, watched from a palace balcony as the president and the first lady, Melania Trump, were warmly greeted by the Prince of Wales and the Duchess of Cornwall on the palace lawn, with Trump holding on to Prince Charles’s hand for 10 seconds.\n\nThe president, who is understood to have also brought his sons Donald Jr and Eric, and his daughter Tiffany on the trip, was then officially welcomed by the Queen on the palace steps. The two shared a slightly awkward half handshake.\n\nAccompanied by Charles, and to a medley of American service tunes played by the band of the Grenadier Guards, Trump then inspected the guard of honour by the Nijmegen Company Grenadier Guards. The first couple later joined the Queen, Charles and Camilla, Prince Harry and other royals for a private lunch, also attended by Ivanka and Kushner.\n\nAs is usual, gifts were exchanged, though it transpired gifts were not Trump’s forte. The Queen presented him with a first edition of The Second World War by Winston Churchill and a three-piece pen set bearing the royal cypher.\n\nBut on a tour of Royal Collection artefacts in the palace’s picture gallery, Trump was also shown the pewter horse he gave the Queen on his last visit. Asked if he recognised it, he replied “no” , at which point Melania jumped in, saying: “Yes, this is one of ours.” Trump did better when he was shown a book of tartans opened at the yellow design of his Scottish Hebridean mother’s MacLeod clan. “That’s my tartan,” he said immediately.\n\nFacebook Twitter Pinterest Donald Trump and the Prince of Wales. Photograph: Victoria Jones/PA\n\nThe presidential plane was met at Stansted by the foreign secretary, Jeremy Hunt. Even as it was taxiing in, Trump was launching his broadside against Khan, who has criticised Britain rolling out the red carpet for the visit.\n\nThe president tweeted: “Sadiq Khan, who by all accounts has done a terrible job as Mayor of London, has been foolishly ‘nasty’ to the visiting President of the United States, by far the most important ally of the United Kingdom. He is a stone cold loser who should focus on crime in London, not me”.\n\nThe president then appeared to use some downtime at the US ambassador’s residence to indulge another favourite pastime, venting his anger on Twitter on the topics of “fake news”, China, and the US broadcaster CNN. “Just arrived in the United Kingdom. The only problem is that CNN is the primary source of news available from the US,” he tweeted before condemning it as “All negative & so much Fake News”.\n\nIn the evening, he tweeted: “London part of trip is going really well. The Queen and the entire Royal family have been fantastic. The relationship with the United Kingdom is very strong. Tremendous crowds of well wishers and people that love our Country.\n\n“Haven’t seen any protests yet, but I’m sure the Fake News will be working hard to find them. Great love all around. Also, big Trade Deal is possible once UK gets rid of the shackles.”\n\nThe state visit is an upgrade on his previous “working visit”, where he had tea with the Queen. Around 170 guests, with cultural, diplomatic and economic links with the US, will join the first couple and senior royals, including the Duke and Duchess of Cambridge, in the grand ballroom at Buckingham Palace to dine off the silver gilt of the Grand Service made for George IV. The Labour leader, Jeremy Corbyn, and the Liberal Democrat leader, Sir Vince Cable, both declined to attend.\n\nHastily offered by Theresa May after Trump’s inauguration, the visit brings down the curtain on her troubled premiership. Trump was vocal ahead of his visit in criticising her handling of Brexit.\n\nGiven both, there was no surprise when it emerged on Monday that there would be no formal one-to-one between the president and the prime minister during the visit. Instead, the two will meet alongside their aides on Tuesday. Asked whether the president had preferred to hold a one-to-one meeting, May’s spokesman said: “I’m sure the answer to that is no.”\n\nWaving banners emblazoned with messages declaring the president was “evil”, scores of protesters blowing whistles and horns massed on a green outside the palace.\n\nDemonstrators, many of who were clutching signs urging people to “just say no” to the special relationship, chanted: “Donald Trump’s not welcome here.”\n\nOutside Buckingham Palace, Weyman Bennett, 54, the co-convenor of Stand up to Racism, who helped organise the protest, said the state visit represented “an insult to people’s basic decent values” and should have been cancelled.\n\n“Sometimes you have to say to a bully they’re wrong and stand up for basic rights. He’s threatened nuclear war, he’s behaved like a boorish idiot, he doesn’t even respect basic diplomatic values.”\n\nFacebook Twitter Pinterest Donald Trump inspects an honour guard at Buckingham Palace. Photograph: Toby Melville/Reuters\n\nBefore the banquet, the Trumps took tea at Clarence House with Charles and Camilla, and laid a wreath on the tomb of the Unknown Warrior, accompanied by the Duke of York.\n\nGiven the 75th anniversary of D-day on Thursday, Trump’s visit culminates on Wednesday, when he will join the Queen during commemorations in Portsmouth. He will also be escorted by May on a private tour of the Churchill War Rooms, from which Winston Churchill directed British forces during the second world war."}, {"link": "https://www.theguardian.com/technology/live/2019/jun/03/wwdc-apple-developer-conference-keynote-live", "published": "2019-06-03T20:11:51", "title": "Apple announces new Mac Pro at WWDC – live updates", "text": "What term do you want to search? Search with google"}, {"link": "https://www.theguardian.com/politics/2019/jun/03/boris-johnson-tory-leadership-campaign-video", "published": "2019-06-03T19:01:35", "title": "Boris Johnson wins key backers after wooing Tories with campaign video", "text": "Boris Johnson has pulled ahead of his closest Tory leadership rivals with a slew of endorsements from prominent party moderates and Brexiters as outsider candidates warned against a “stitch-up” barring them from the ballot.\n\nJohnson, who has kept a low profile in the contest so far, launched his campaign in earnest with a video posted on social media highlighting his credentials.\n\nHis team then released endorsements throughout the day from MPs across the party’s spectrum, including the Brexit minister Kwasi Kwarteng and Simon Hart, who coordinates the moderate Brexit Delivery Group.\n\nConcern is growing among some Conservative MPs that a change in the rules could lead to a coronation of Johnson before some of the lesser-known candidates have had a chance to gain momentum.\n\nThere are 13 declared candidates and the list could grow on Tuesday. Supporters of the defence secretary, Penny Mordaunt, say she will make a decision about running after an evening conference call with grassroots activists.\n\nThe 1922 Committee of Tory backbenchers, which will run the contest, will hold an executive meeting on Tuesday as calls grow for changes to the rules to reduce the size of the field. The communities secretary, James Brokenshire, compared the race to the Grand National and suggested changes were needed to prevent the contest from dragging on.\n\nQ&A How do the Tories elect a new leader? Show Hide A Conservative leadership contest has two stages. First, MPs vote for their choice from the nominated candidates. In each round of voting, the candidate with the least number of votes is eliminated from the contest. MPs vote again, until there are only two challengers remaining. This usually takes place over several days, and candidates often withdraw from the process if they see they have no chance of winning. The second stage is a postal ballot of Conservative party members to chose one of the two candidates, meaning around 120,000 people will choose the UK's next prime minister. Theresa May will formally resign on 7 June, and nominations to be leader are expected to close the following week. The contest should be finished by the end of July.\n\n“If you already know it’s going to be a bit of a struggle to get over the first fence, let alone Becher’s Brook ahead, then maybe you should pull up,” he said in a speech at Policy Exchange on Monday. “There is no embarrassment in that.”\n\nSeveral of the committee’s executive members have suggested candidates should be required to have the support of at least 12 MPs before they can be on the ballot. Such a cut-off would eliminate a significant number of the candidates: Mark Harper, Rory Stewart, Esther McVey, James Cleverly, Andrea Leadsom, Kit Malthouse and Sam Gyimah.\n\nCleverly, a Brexit minister who is running a campaign as a new generation candidate, said the Conservative membership needed to be given “the chance to be gutsy” and warned against “rushing” the contest.\n\n“This is a real opportunity for us to properly test ideas and people and we are looking for somebody who will not only deliver Brexit but be leader of the party for years into the future and has to reach out to a lot of voters,” he said. “We need to win the next general election and I think rushing it could be counterproductive. Investing maybe an extra five days in the process to make sure we get it right for the next five years is time well spent.”\n\nOne supporter of an outsider candidate said they believed some on the 1922 Committee were trying to rig the rules in favour of Johnson, arguing it was highly unfair on some hopefuls to change the rules before any hustings had taken place to let them demonstrate their potential. But one of the leading candidates said it made sense to knock out the “minnows” in the race and concentrate on those who had a chance of winning.\n\nSupporters of Johnson increasingly believe the race is likely to head for a “psychodrama” of a run-off between their candidate and Michael Gove, who knocked him out of the race in 2016. However, those around Jeremy Hunt, Dominic Raab, Sajid Javid and Matt Hancock all insist they are in with a chance of prevailing, with about 150 Conservative MPs still to say who they are backing.\n\nIn Johnson’s video, released on Monday morning, he meets voters and promises one former Conservative voter that he will take Britain out of the EU on 31 October, deal or no deal.\n\nFacebook Twitter Pinterest Boris Johnson in his campaign video. Photograph: Twitter\n\nThe video expresses support for increased education funding and police numbers and shows Johnson agreeing with a voter on the need for more stop and search.\n\nThe launch was not entirely without a hitch. Johnson was criticised for claiming that crime in London went down 20% while he was mayor. The Liberal Democrats pointed to official government figures suggesting police-recorded crime in London fell by 15% from 2007-08 to 2015-16. Ed Davey, a Lib Dem leadership candidate, said: “For Johnson to kick off his leadership campaign with a lie is at least very on-brand.”\n\nLiz Truss, the former chief secretary to the Treasury, who had been considering a run at the leadership herself, was the first of the current cabinet to endorse Johnson over the weekend.\n\nIt is believed unlikely that Johnson will secure the backing of the work and pensions secretary, Amber Rudd – a joint ticket that had been nicknamed “Bamber” – because of Rudd’s discomfort at serving in a cabinet that could pursue a no-deal Brexit.\n\nOther prominent names backing Johnson include the chair of the European Research Group, Jacob Rees-Mogg, the former defence secretary Gavin Williamson and the backbencher Zac Goldsmith."}, {"link": "https://www.theguardian.com/media/2019/jun/03/swedish-court-rejects-request-to-detain-julian-assange", "published": "2019-06-03T19:06:26", "title": "Swedish court rejects request to detain Julian Assange", "text": "An attempt to extradite Julian Assange to Sweden has suffered a setback after a court in Uppsala said he did not need to be detained.\n\nThe ruling by the district court prevents Swedish prosecutors from applying immediately for an extradition warrant for Assange to face an allegation of rape dating back to 2010. Assange denies the accusation.\n\nAssange is serving a 50-week sentence in Britain for skipping bail after he spent seven years in the Ecuadorian embassy in London attempting to avoid extradition to Sweden.\n\nSwedish prosecutors dropped their rape investigation in 2017 but reopened it after Ecuador rescinded its grant of asylum to Assange in April this year and allowed British police to arrest him.\n\nThe 47-year-old Australian was too ill to appear last week at the latest hearing at Westminster magistrates court in relation to a rival US extradition request.\n\nUS government lawyers are seeking his removal to the US where he is charged with conspiracy to commit computer intrusion, which carries a maximum penalty of five years. He also faces additional charges of violating the Espionage Act by publishing classified information through WikiLeaks.\n\nIf both Sweden and the US present competing extradition requests, it will be up to the UK home secretary, Sajid Javid, to decide which application takes priority.\n\nAt the Swedish court on Monday, a judgment was read out saying that since Assange was already in a British prison he did not need to be formally detained to be questioned by Swedish prosecutors.\n\n“As Julian Assange is currently serving a prison sentence, the investigation can proceed with the help of a European investigation order, which does not require Julian Assange’s detention (in Sweden). The court therefore does not find it proportional to detain Julian Assange,” the judgment said.\n\nAssange’s Swedish defence lawyer, Per Samuelson, argued that Assange’s imprisonment in Britain meant there was no flight risk. “He is in prison for half a year at least, and he is detained on behalf of the United States. So there is no point detaining him in Sweden too,” Samuelson said.\n\nResponding to the ruling, the Swedish prosecutor Eva-Marie Persson said: “The investigation continues with interviews in Sweden. I will also issue a European investigation order in order to interview Julian Assange. No date has been set yet. We will constantly review the state of the investigation.”\n\nBefore the judgment, the prosecutor confirmed that if the court granted her request she intended to issue a European arrest warrant for Assange “concerning surrender to Sweden”."}]}, "breitbart": {"link": "http://www.breitbart.com/", "articles": [{"title": "Chinese Defense Minister: Tiananmen Square Was 'Correct Policy'", "text": "China’s defense minister, General Wei Fenghe, told an audience in Singapore Sunday that the Tiananmen Square massacre – the brutal crackdown of anti-communist protests in Beijing in 1989 – was a “correct policy” and credited the mass murder with bringing “stability and development” to the country.\n\nChina has spent decades attempting to fully censor the incident and has never allowed estimates on the number killed or imprisoned. Experts believe Chinese Communist Party police and soldiers killed hundreds, if not thousands, of protesters demanding liberal democracy, inspired by the impending fall of the Soviet Union and similar protests nationwide. Until this year, China had largely ignored the anniversary of the protests, censoring all mention of it on the Chinese internet.\n\nIn a sign of potentially admitting defeat – or being comfortable enough with its repression to not fear inspiring outrage – Wei answered a question about Tiananmen, defending the incident, and China’s state-run newspaper Global Times published an article celebrating the “incident.”\n\nWei spoke at the Shangri-La Dialogue, a global defense forum.\n\n“That incident was a political turbulence and the central government took measures to stop the turbulence which is a correct policy,” he said in response to a question about the anniversary of the massacre. “The 30 years have proven that China has undergone major changes China has enjoyed stability and development.”\n\nWei reportedly questioned why the world frowned upon China killing hundreds of its citizens, according to Agence France-Presse, and recommended that critics “visit China” to “better understand” why the Communist Party chose the mode of action it did.\n\nChina has invested years of time and energy into erasing the Tiananmen Square massacre. Extensive censorship online redirects or blocks searches for the event, schools do not teach it, and commemorating those killed in public could lead to severe police retribution. Chinese officials closely monitor social media to preemptively block any content educating readers about the killings. As of 2015, only 15 of 100 students surveyed could identify the photo known as “tank man” – the iconic image of a Chinese protester standing in front of a tank in Tiananmen Square. China has never allowed the public to identify the man or revealed his fate.\n\nThis year, however, the Chinese Communist Party is going on the offensive, claiming the crackdown was necessary to preserve communism and only enemies of the Chinese state support such popular uprisings. In addition to Wei’s comments, the Global Times published an editorial Sunday defending the killings and their subsequent censorship.\n\n“We consider such practice a political success, although some people have criticized it from the perspective of news governance. Merely afflicting China once, the incident has not become a long-term nightmare for the country,” the Times claimed. “Neither has the incident’s anniversary ever been placed in the teeth of the storm. It has become a faded historical event, rather than an actual entanglement.”\n\nThe Times column goes on to praise China for being too “mature” to have a repeat of the protests and state that the incident was a “vaccination” for China against “major political turmoil.”\n\nIn addition to the Tiananmen Square killings, Wei defended the modern use of concentration camps to torture and enslave the nation’s Uighur, Kazakh, and Kyrgyz Muslim minorities. The Pentagon estimates that China has imprisoned as many as 3 million people in the camps, where they are forced to memorize communist propaganda songs, learn Mandarin, worship Communist Party leader Xi Jinping, and make cheap clothing in sweatshops.\n\nChinese officials call the camps “vocational training centers,” claiming that they send individuals there to learn skills necessary to be competitive in the Chinese economy. Without that training, authorities claim, Muslims are naturally susceptible to joining jihadist groups. Relatives of the imprisoned say many are highly educated, held stable jobs, and had no need for such training before being imprisoned.\n\n“China’s policy in Xinjiang is absolutely right,” Wei said in Singapore. “Vocational education ensures there are no terrorist attacks … Over the past more than two years there has not been a single terrorist attack in Xinjiang.”\n\nWei also addressed China’s growing belligerence against Taiwan and threatened military action to colonize it.\n\n“The Taiwan question bears on China’s sovereignty and territorial integrity. Not a single country in the world would tolerate secession,” Wei said. “I visited the US last year. American friends told me that Abraham Lincoln was the greatest American president because he led the country to victory in the Civil War and prevented the secession of the US. The US is indivisible, so is China. China must be and will be reunified. We find no excuse not to do so.”\n\n“If anyone dares to split Taiwan from China,” he warned, “the Chinese military has no choice but to fight at all costs for national unity.”\n\nTaiwan has been a sovereign state operation outside of Beijing’s control since 1945.\n\nFollow Frances Martel on Facebook and Twitter.", "link": "https://www.breitbart.com/asia/2019/06/03/chinese-defense-minister-tiananmen-square-massacre-was-correct-policy/", "published": "2019-06-03T00:00:00"}, {"title": "Illegals Get Minimum Sentences for Killing Couple, Raping 12-Year-Old", "text": "Two illegal aliens received prison sentences of 12 to 2o years, one for killing a young couple in a sanctuary city and another for raping a 12-year-old girl.\n\nThe Angel Family of 34-year-old Logan Wilson and his wife 32-year-old Jessica Wilson is outraged after an illegal alien was sentenced to just 12 years in prison after killing the young couple in a drunk driving crash in August 2018 in the sanctuary city of Marion County, Oregon.\n\nWeeks ago, illegal alien Eduardo de la Lima Vargas from Mexico received a sentence of 12 years after killing the Wilsons, leaving their three young children now without parents, in a drunk driving crash where the couple’s motorcycle was wedged under the illegal alien’s pickup truck, Breitbart News originally reported.\n\nAccording to prosecutors, Lima Vargas was driving with a blood-alcohol level of .10 percent when he hit and killed Logan and Jessica Wilson.\n\nIn interviews with the Statesman Journal last month, the family expressed their dissatisfaction with the sentencing of Lima Vargas:\n\nFamily members of the victims said the fact that De La Lima-Vargas would be housed and fed by the government and allowed to see his family while incarcerated felt like a “slap in the face.” [Emphasis added] … Logan’s sister Mariah Turnidge called De La Lima-Vargas an “incredibly selfish, immoral person.” She said he could’ve called a cab or slept in his vehicle the night of the crash. [Emphasis added]\n\nA separate case last month ended with an illegal alien convicted of raping a 12-year-old Mississippi girl receiving a sentence of 20 years, the minimum sentence for statutory rape of a child in the state.\n\nValentin Ariosto Alfonso-Arguello, a 38-year-old illegal alien, received just 20 years in prison with eight years suspended for coercing a 12-year-old girl into giving him her phone number, then raping her in his truck after getting off work.\n\nAfter his release, Alfonso-Arguello is expected to be turned over to the Immigration and Customs Enforcement (ICE) agency and deported.\n\nIn 2018, ICE agents arrested more than 1,640 illegal aliens convicted of murder, nearly 5,000 convicted of child sex abuse, and more than 54,600 who were convicted of drunk driving, Breitbart News reported. The vast majority of illegal aliens living across the United States, of which there are 11 to 22 million, are never deported.\n\nJohn Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.", "link": "https://www.breitbart.com/politics/2019/06/02/illegal-aliens-get-minimum-sentences-killing-couple-raping-12-year-old/", "published": "2019-06-02T00:00:00"}, {"title": "President Trump Lays Wreath at Tomb of the Unknown Warrior", "text": "President Donald Trump laid a wreath at, and prayed over the interred remains of an unknown combatant of the Great War of 1914-1918 on Monday morning, during a visit to Westminster Abbey on his State Visit to the United Kingdom.\n\nThe visit to the Abbey, the historic place of burial and coronations for English and British Kings and Queens for nearly 1,000 years, was hosted by British Royal Prince Andrew and the chapter officers of the Abbey itself. President Trump was driven from Buckingham Palace, where he had eaten lunch with Queen Elizabeth II, to the Abbey in the Presidential motorcade in a journey along the Mall and Horse Guard’s which took a little less than two minutes to complete.\n\nBritain’s Sky News reported pro-Trump supporters outnumbered antis outside Buckingham Palace as the President’s car drew by, but noted protests against President Trump are expected in London tomorrow.\n\nOnce at the Abbey, which significantly predates the establishment of the modern British state and has roots in the 10th century, President Trump ceremonially laid a wreath at the Tomb of the Unknown Warrior and joined in prayers.\n\nThe oversize wreath was lowered into position by two U.S. Marines for the President, who knelt with the First Lady to lay their hands on the flowers before praying.\n\nThe President and his family were then given a tour of the Abbey, which is the resting place of thousands of notable Britons including leading figures in the military and arts, as well as Royals, before departing to take afternoon tea with Prince Charles, who is first in line to the throne after the Queen.\n\nThe Tomb of the Unknown Warrior holds the mortal remains of an unidentified British soldier who was killed in France during the Great, or First World War. The body was interred with full state honours, having been transported from the European battlefield, in 1920 as a focus for collective national grief and mourning, and a tomb for the thousands of families whose loved ones who were killed and remains remained missing.\n\nThe Unknown Warrior was awarded the Congressional Medal of Honour by the United States the following year, the medal was on display today for the President to inspect.\n\nPresident Trump is on a three day State Visit to the United Kingdom, a guest of Her Majesty the Queen. After a full state banquet tonight with the Royal Family and 170 guests, the President is expected to have a day of high-level political meetings tomorrow.", "link": "https://www.breitbart.com/europe/2019/06/03/pictures-president-trump-lays-wreath-at-tomb-of-the-unknown-warrior-in-westminster-abbey/", "published": "2019-06-03T00:00:00"}, {"title": "Nigel Farage Hails Anglo-American ‘Hand of Friendship’ During Trump Visit", "text": "Brexit leader Nigel Farage has spoken out in support of President Donald Trump’s state visit to the UK on Monday, talking of the “hand of friendship” extended between the two nations.\n\n“As Trump arrives in the UK for his 3-day visit, he comes offering a trade deal if we need one, but also American’s hand of friendship. As the democratically elected leader of the free world, we should extend to him a welcome that befits the status of his office & great country,” the Brexit Party leader wrote Monday.\n\nAs Trump arrives in the UK for his 3-day visit, he comes offering a trade deal if we need one, but also American's hand of friendship. As the democratically elected leader of the free world, we should extend to him a welcome that befits the status of his office & great country. — Nigel Farage (@Nigel_Farage) June 3, 2019\n\nPresident Trump has hailed Farage as a friend and the two men are understood to keep in touch, with Mr Farage updating the President on the lack of progress the British government is making on taking the United Kingdom out of the European Union. President Trump said in an interview ahead of his State Visit that Farage should have been invited to be a part of the Brexit negotiating team.\n\nHe said: “I think it is a mistake. He (Farage) has a lot to offer. He is a very smart person. They won’t bring him in. Think how well they would do if they did. They just haven’t figured that out yet.”\n\nPresident Trump also congratulated Mr Farage on the outstanding success of the newly formed Brexit Party which has recently topped the national polls and won the EU elections. Mr Trump said last week: “I hear he has done very well. I think he has got a lot to offer. Obviously, a lot of people agree with me because I saw his numbers and they were very good.”\n\nIt is clear Donald Trump wants Brexit to happen. He is a true friend to Britain. pic.twitter.com/bWpfROqUd7 — Nigel Farage (@Nigel_Farage) June 3, 2019\n\nTrump specifically congratulated Nigel Farage and the Brexit Party on their victory in the European Parliament elections and also described Mr Farage as a “friend of mine”, a sentiment echoed by Mr Farage in a tweet this afternoon in which he said: “It is clear Donald Trump wants Brexit to happen. He is a true friend to Britain”.\n\nThere are unconfirmed reports that the President asked for Mr Farage to be in attendance at the state banquet being hosted for the President by the Queen, to which President Trump would be allowed to invite a small number of personal guests. However, Mr Farage claims that the prime minister’s officials have told the U.S. leader not to meet with Mr Farage during his visit, a move which Farage branded “absolutely ludicrous”.", "link": "https://www.breitbart.com/europe/2019/06/03/nigel-farage-talks-up-hand-friendship-between-us-uk/", "published": "2019-06-03T00:00:00"}]}, "infowars": {"link": "https://www.infowars.com/", "articles": [{"title": "Shock Video: Violent Leftist Spits on Pro-Trump Woman, Gets Arrested", "text": "An angry anti-Trumper harassed and physically assaulted Trump supporters during a pro-Trump demonstration in California.\n\nVideo footage shows an angry black man pull up in a car and get out to curse at several Trump supporters demonstrating on a curb, going as far as knocking the hat off one and spitting on a woman while shouting “Fuck Donald Trump!”\n\n“Fuck Donald Trump, nigga! Fuck Donald Trump! Fuck you and Donald Trump!” he yelled inches from their faces. “Because you don’t like my skin, nigga! That’s why!”\n\nA pro-Trump woman yelled back through a megaphone, “Donald Trump is your president whether you like that shit or not, if you don’t like the president then you can get the fuck outta my country then!”\n\nThe man then approached her, saying “Fuck you and that nigga!” before spitting on her.\n\nOther anti-Trumpers arrived, trying to fight the Trump supporters and steal one of their American flags.\n\nPolice soon arrived and arrested the irate man after being presented video evidence of his assaults against supporters.\n\nAs we’ve reported, violence against Trump supporters is frequent, consistent, and well-documented despite mainstream media efforts to downplay or ignore these reports.\n\nAlex Jones and the crew were recently at a Mexican restaurant in Austin when cameras caught him in the midst of participating in what AOC says colonial racism.", "link": "https://www.infowars.com/shock-video-violent-leftist-spits-on-pro-trump-woman-gets-arrested/", "published": "2019-06-03T12:28:12-05:00"}, {"title": "Shock Video: Violent Leftist Spits on Pro-Trump Woman, Gets Arrested", "text": "An angry anti-Trumper harassed and physically assaulted Trump supporters during a pro-Trump demonstration in California.\n\nVideo footage shows an angry black man pull up in a car and get out to curse at several Trump supporters demonstrating on a curb, going as far as knocking the hat off one and spitting on a woman while shouting “Fuck Donald Trump!”\n\n“Fuck Donald Trump, nigga! Fuck Donald Trump! Fuck you and Donald Trump!” he yelled inches from their faces. “Because you don’t like my skin, nigga! That’s why!”\n\nA pro-Trump woman yelled back through a megaphone, “Donald Trump is your president whether you like that shit or not, if you don’t like the president then you can get the fuck outta my country then!”\n\nThe man then approached her, saying “Fuck you and that nigga!” before spitting on her.\n\nOther anti-Trumpers arrived, trying to fight the Trump supporters and steal one of their American flags.\n\nPolice soon arrived and arrested the irate man after being presented video evidence of his assaults against supporters.\n\nAs we’ve reported, violence against Trump supporters is frequent, consistent, and well-documented despite mainstream media efforts to downplay or ignore these reports.\n\nAlex Jones and the crew were recently at a Mexican restaurant in Austin when cameras caught him in the midst of participating in what AOC says colonial racism.", "link": "https://www.infowars.com/shock-video-violent-leftist-spits-on-pro-trump-woman-gets-arrested/#vuukle-comments", "published": "2019-06-03T12:28:12-05:00"}, {"title": "Watch: PSA From Tomorrow’s Thought Police", "text": "Watch this sharp video from Erwins Real News that exposes thought police from the future in his latest entry into Infowars.com’s free speech poster challenge.\n\nDue to the high volume of phenomenal entries, Infowars.com again urges all participants to abide by all local ordinances and other relevant laws. We also don’t want your entry to expose your personal information to the public, like an address or license plate. Be vigilant!\n\nDo your part and spread the message of liberty to friends, family, and your neighbors. Just like these fine people did (Quirky FollowsQ & Mr. Micah):\n\nWe’re offering $5000 for the top effort to strategically place posters in a lawful, public commons area and film its placement.\n\nSend a link to your video entry to [email protected] by Monday, June 10, at Midnight CDT.\n\nAdditionally, we’re offering $1000 for Second Place and $500 for Third Place:\n\nFirst Place: $5000\n\nSecond Place: $1000\n\nThird Place: $500\n\nHere’s three more example entries to get you started:\n\nRules:\n\nPlease remember to abide by all local ordinances and other relevant laws when displaying your posters. A good rule of thumb is to post them in entertainment, eatery and bar areas where other posters may be posted.\n\nYou can create your own poster or use ours (links to poster-sized images below). But if you use your own poster, remember to include the Infowars.com address.\n\nSend a link to your video entry to [email protected] by Monday, June 10, at Midnight CDT. We will post entries to Infowars.com that put in good effort.\n\nHonor the fallen. Fight for freedom.\n\nHere’s poster designs you can print out and post in your area.\n\nClick to enlarge for a printable version, and then right-click ‘Save Image As…’ to save it to your computer and print copies.\n\nAnd here are a few vintage poster designs:\n\nBelow is a video of Kaitlin Bennett hanging up a poster, and showing why it’s critical to educate everyone on the importance of free speech:\n\nPost photos of your efforts on social media under the hashtag #FreeInfowars or #IamAlexJones.\n\nRemember to place them in legal and lawful areas and abide by all local ordinances when displaying your posters. Some places you might post them include entertainment venues, eateries, bars or other public commons areas where posters are already featured.\n\nAs always, we here at Infowars salute you, our humble audience, and are deeply grateful for your continued support.\n\nTell the world you will NOT BE SILENCED.", "link": "https://www.infowars.com/watch-psa-from-tomorrows-thought-police/", "published": "2019-06-03T12:05:26-05:00"}]}, "foxnews": {"link": "http://www.foxnews.com/", "articles": []}, "nbcnews": {"link": "http://www.nbcnews.com/", "articles": [{"title": "Thuy Dinh Marie Kondo's advice for decluttering threatens the cultural heritage of refugees like me", "text": "Thuy Dinh Marie Kondo's advice for decluttering threatens the cultural heritage of refugees like me\n\nThe organizing guru recommends throwing out objects that don't \"spark joy\" in the present. But those items could be treasures for the next generation.", "link": "https://www.nbcnews.com/think/opinion/marie-kondo-s-advice-decluttering-threatens-cultural-heritage-refugees-me-ncna1012661", "published": "2019-06-03T08:52:00+00:00"}, {"title": "In a culture that glorifies contrarians, the case for conformity", "text": "In a culture that glorifies contrarians, the case for conformity\n\nBravery can mean defying your peers, but it can also mean standing with them in solidarity.", "link": "https://www.nbcnews.com/think/opinion/culture-glorifies-contrarians-case-conformity-ncna1013231", "published": "2019-06-03T18:18:57+00:00"}, {"title": "Netflix's 'When They See Us,' Ava DuVernay's Central Park Five series, is a harrowing call to action", "text": "Netflix's 'When They See Us,' Ava DuVernay's Central Park Five series, is a harrowing call to action\n\nDuVernay portrays the all-encompassing and emotionally exhausting struggle for justice. But there are no happy endings here.", "link": "https://www.nbcnews.com/think/opinion/netflix-s-when-they-see-us-ava-duvernay-s-central-ncna1012856", "published": "2019-06-02T13:45:00+00:00"}]}, "washingtonpost": {"rss": "http://feeds.washingtonpost.com/rss/world", "link": "https://www.washingtonpost.com/", "articles": [{"link": "https://www.washingtonpost.com/world/the_americas/canadian-government-inquiry-indigenous-women-have-been-victims-of-race-based-genocide/2019/06/02/3d46f670-8329-11e9-b585-e36b16a531aa_story.html", "published": "2019-06-03T08:00:00", "title": "Canadian government inquiry assails ‘genocide’ of indigenous women, girls", "text": "\n\nWomen embrace during the closing ceremony Monday of the National Inquiry into Missing and Murdered Indigenous Women and Girls in Gatineau, Quebec. (Chris Wattie/Reuters)\n\nFor decades, Canada’s indigenous people have warned that a disproportionately large number of their women and girls were vanishing or being killed, that police investigations of these crimes were careless, and that their pleas for help were being ignored.\n\nOn Monday, the government-appointed commission that has been investigating the claims announced its explosive conclusion: Canada’s indigenous women and girls are “under siege,” and their deaths and disappearances amount to “a race-based genocide.”\n\nThe Canadian National Inquiry into Missing and Murdered Indigenous Women and Girls released its final report at a morning ceremony in Gatineau, Quebec, with Prime Minister Justin Trudeau and family members of victims.\n\n“Genocide is the sum of the social practices, assumptions and actions detailed within this report,” the commission concluded. It laid out in detail over more than 1,200 pages how a mix of “appalling apathy” and “colonialist structures” has fueled a “national tragedy” centuries in the making.\n\n“This is not what Canada is supposed to be about,” the commission wrote. “It is not what it purports to stand for.”\n\nThe commission itself has drawn criticism for staff turnover and an alleged lack of transparency. Critics say the process won’t bring justice because the panel wasn’t granted the authority to compel police to reopen cold cases.\n\n[Canada’s inquiry into missing and murdered indigenous women gets a failing grade]\n\nTrudeau, who promised a “total renewal” of Canada’s relationship with its 1.6 million indigenous people, launched the $92 million inquiry shortly after assuming office in 2015.\n\n\n\nCanadian Prime Minister Justin Trudeau and his wife Sophie take part in a moment of silence during the ceremony. (Chris Wattie/Reuters)\n\n“This is an uncomfortable day for Canada, but it is an essential day,” he said Monday. He promised to review the report and to implement a plan. The report “will not be placed on a shelf to collect dust,” he promised, to applause.\n\nThe commission, headed by Marion Buller, British Columbia’s first female indigenous judge, crisscrossed the country for more than two years to take testimony from roughly 2,400 witnesses, including survivors and family members of victims.\n\nThey described the bodies of sisters, mothers and daughters being dredged out of rivers or found along a desolate stretch of highway in British Columbia where so many indigenous women and girls have disappeared or been killed that it’s called the “Highway of Tears.”\n\nWitnesses told the commission that police were slow to launch missing-persons investigations and quick to label unexplained deaths as drownings, suicides or drug overdoses, even when evidence suggested foul play.\n\nThe Royal Canadian Mounted Police reported 1,181 cases of murdered or missing indigenous women and girls from 1980 to 2012. Indigenous women are six times as likely to be victims of homicide than non-indigenous women, the government agency Statistics Canada reported in 2017.\n\nBut those figures could be a gross undercount, according to the commission, which concluded that “no one knows the exact number” because thousands of deaths and disappearances “have likely gone unrecorded.”\n\nThe commission concluded that colonial violence, racism, sexism, homophobia and transphobia against indigenous women and girls have become so woven into the fabric of their lives that many have become accustomed to it.\n\n\n\nTrudeau holds the final report. (Chris Wattie/Reuters)\n\nContributing to the violence, the commission said, are historical trauma from government-directed family separation policies, residential schools and land dispossession; social and economic marginalization; and a lack of willingness among Canadian institutions to change.\n\n[The mystery of 1,000 missing and murdered indigenous women in Canada]\n\nAn “absolute paradigm shift” is needed “to dismantle colonialism within Canadian society,” the commission said.\n\nAmong its 231 recommendations, the commission advised creating an independent task force to investigate unresolved cases, increasing punishments for violent offenses when the victims are indigenous women, and granting indigenous languages the same official status as English and French.\n\n“Today, we hold up a mirror to Canada,” Buller said. She said the report’s action items were not just “recommendations” but “legal imperatives.”\n\nTrudeau promised change.\n\n“I know and you know that we need to fix the way things work in this country,” he said. “We must continue to decolonize our existing structures, and the racism, sexism and economic inequality that has allowed such violence against indigenous women and girls to prevail must be eradicated.”\n\nCanada’s indigenous people long called for a probe into missing and slain women and girls. Trudeau’s Conservative predecessor, Stephen Harper, said the issue had been “studied to death” and was not “really high” on his government’s “radar.”\n\n\n\nJenny Blackbird of Kehewin Cree Nation in Alberta raises a cup of sacred water as hundreds gather in Toronto in honor of Tina Fontaine, who was found killed 2014. (Bernard Weil/Toronto Star via Getty Images)\n\nThe death in 2014 of 15-year-old Tina Fontaine, whose body was found in a Manitoba river wrapped in a blanket and weighed down with rocks, galvanized public attention. In the 24 hours before her death, she met with social workers, police and emergency room doctors, but no one kept her safe.\n\n“The fact that this national inquiry is happening now doesn’t mean that indigenous people waited this long to speak up,” the commission said. “It means it took this long for Canada to listen.”\n\nNot everyone felt heard.\n\nDanielle Ewenin said she attended a commission hearing in Saskatchewan in 2017 to testify about her sister.\n\nEleanor “Laney” Ewenin was found dead in a field on the outskirts of Calgary in 1982 at age 23. Police filed a report under an incorrect name; the case remains unsolved.\n\nEwenin said she decided to testify because she “wanted to make a difference for indigenous women.” But, she said, the inquiry operated under a patriarchal and colonial model that was not responsive to families, and its “mismanagement, bungling, ineptness and incompetence” doomed it to fail.\n\nEwenin said frequent calls to her caseworker, responsible for helping her track down police and coroner’s reports, went unanswered. She eventually obtained the records herself, she said, but was told it was too late to include them in the inquiry’s forensic audit of police files.\n\n“I’m having a hard time disassociating myself from my feelings of anger and betrayal and injustice,” she said. “They did not find or honor the truth with my sister.”\n\n\n\nA woman holds a sign during the ceremony in Gatineau. (Chris Wattie/Reuters)\n\n\n\nWomen march into the ceremony. (Chris Wattie/Reuters)\n\nCalls from family members of victims to reset the inquiry in 2017 went unheeded.\n\nBuller told The Washington Post last year that the commission had struggled with communicating with families. She blamed early missteps on bureaucratic challenges and the initial two-year deadline. (Buller requested a two-year extension. The government granted six more months.)\n\nIn a foreword to the report, Buller criticized the government for failing to grant the full extension, saying “many truths” will go “unspoken and unknown” as a result.\n\nThe commission said the additional time would have allowed the forensic audit team to look at more files, such as those pertaining to Ewenin’s sister.\n\nThe commission said police blamed victims and employed racist stereotypes in interactions with indigenous women. It singled out the RCMP for failing to provide all of the files it subpoenaed.\n\nAnita Ross testified before the commission in Thunder Bay, Ontario, about the death of her 16-year-old daughter. Delaine Copenace went missing in 2016 and was found dead weeks later in a lake near her home. Police were late to investigate her disappearance, Ross said, and labeled her death an accidental drowning — a conclusion she rejects.\n\nRoss watched the ceremony on television. She was glad to see Trudeau attending with his wife, she said, and was “trying to feel optimistic.”\n\nThe question is whether the government will act.\n\n“We’re all hopeful, but we’re just wondering if it will happen,” she said. “People say things, but will they follow through?”\n\nRead more\n\nCanadian police force slammed for handling of dozens of indigenous deaths\n\nThe latest front in Canada’s effort to reconcile with indigenous Canadians: Language\n\n‘Third World conditions’: Many of Canada’s indigenous people can’t drink the water at home\n\nToday’s coverage from Post correspondents around the world\n\nLike Washington Post World on Facebook and stay updated on foreign news"}, {"link": "https://www.washingtonpost.com/world/middle_east/trump-tells-israelis-to-get-their-act-together-as-country-gears-up-for-second-election-this-year/2019/06/03/c717fe76-85e5-11e9-98c1-e945ae5db8fb_story.html", "published": "2019-06-03T13:09:36", "title": "Trump tells Israelis to ‘get their act together,’ as country gears up for second election this year", "text": "As President Trump left Washington on Sunday for a three-day visit to Britain, he aired his frustrations that Israel is heading to a second general election less than two months after the last one, further roiling an already turbulent Israeli political scene.\n\n“I mean, that came out of the blue three days ago. So that’s all messed up,” Trump said in comments to reporters. “They ought to get their act together. I mean, Bibi got elected. Now, all of a sudden, they're going to have to go through the process again until September?”\n\nThe president, who referred to Israeli Prime Minister Benjamin Netanyahu by his nickname, called the situation “ridiculous” and said he was “not happy about that.”\n\nTrump has done little to hide the fact that he prefers Netanyahu, Israel's prime minister for a total of more than 13 years, to continue to lead the country.\n\nNetanyahu’s ruling Likud party won the largest share of the vote in April 9 elections and appeared to have the clearest path to forming a coalition, leading to an expectation that he would form a new government and begin his fourth term as Israel's prime minister.\n\n\n\nBut in Israel's splintered parliamentary system, being able to form a majority in the 120-seat Knesset, Israel's parliament, is all that matters, and Netanyahu ultimately failed in that task before the legal deadline expired.\n\nApparently unwilling to follow precedent by giving someone else the chance to form a coalition, the longtime leader’s political supporters pushed through a motion last week to dissolve the Knesset, propelling the country to a second round of elections on Sept. 17.\n\n[Israel will hold unprecedented second election after Netanyahu fails to form governing coalition]\n\nFor Trump, the new elections make the future of his political ally, who is also battling corruption charges, even more uncertain. But they also leave Trump’s much-touted peace plan in limbo.\n\nThe president’s Middle East envoy, his son-in-law Jared Kushner and his former lawyer Jason Greenblatt, planned to begin the first stage of the rollout of the long-awaited plan immediately after Israel's elections and the formation of a new government.\n\nThe first stage, an economic workshop to build support for the financial aspects of the plan, is scheduled to take place in late June, with the political portion expected to follow quickly.\n\nWith a second Israeli election campaign now in progress, that appears increasingly unlikely, although U.S. officials have said the Bahrain conference will go ahead as planned.\n\nBut even some in the administration appear to have little hope that it can succeed at all. On Sunday, The Post published an audio recording revealing that Secretary of State Mike Pompeo had serious doubts about the prospects for the forthcoming peace plan.\n\n[Exclusive: Pompeo delivers unfiltered view of Trump’s Middle East peace plan in off-the-record meeting]\n\nSpeaking at a meeting on Tuesday of the Conference of Presidents of Major American Jewish Organizations, a New York-based group that addresses concerns of the Jewish community, Pompeo said that some might describe the plan as \"unexecutable.\" He also said the administration had prepared for the eventuality that the plan does not gain traction and that Israel begins annexing parts of the West Bank anyway.\n\nThe plan to solve a decades-old intractable conflict between Israelis and Palestinians has also been overshadowed by a crisis in diplomatic relations between the United States and the Palestinians. The current U.S. administration has taken actions vehemently opposed by the Palestinians, including recognizing Jerusalem as Israel’s capital without a final-status agreement, cutting funding to the Palestinian Authority and the U.N. refugee agency that serves it, forcing the Palestinian Authority’s diplomatic office in Washington to close, and recognizing Israeli sovereignty over the Golan Heights.\n\nThe announcement last month that the anticipated peace process would begin with the economic forum in Bahrain was met with hostility by the Palestinian leadership. In comments last week in Ramallah, Palestinian Authority President Mahmoud Abbas said the conference could go to hell.\n\n“The Palestinian Authority does not recognize this conference,” he said.\n\nIn his comments to the press on Sunday, Trump said he still thought there was a chance for peace.\n\n“Well, let’s see what happens. I mean, look, we're doing our best to help the Middle East to get a peace plan,” the president said. “And he may be right. I mean, most people would say that. I think we have a good chance, but we'll see what happens.”\n\nGearan reported from London.\n\nRead more:\n\nIsrael just held elections, but it might have a do-over\n\nPalestinian leaders say U.S. ‘Peace to Prosperity’ summit slights them\n\nToday’s coverage from Post correspondents around the world\n\nLike Washington Post World on Facebook and stay updated on foreign news"}, {"link": "https://www.washingtonpost.com/world/national-security/exclusive-pompeo-delivers-unfiltered-view-of-trumps-middle-east-peace-plan-in-off-the-record-meeting/2019/06/02/94527d80-3a2c-4f04-b8f9-dd3fd78a5a8c_story.html", "published": "2019-06-02T10:40:00", "title": "Exclusive: Pompeo delivers unfiltered view of Trump’s Middle East peace plan in off-the-record meeting", "text": "Secretary of State Mike Pompeo listens as Prime Minister of Israel Benjamin Netanyahu speaks with President Trump before the presidential proclamation on Golan Heights at the White House in March. (Jabin Botsford/The Washington Post)\n\nSecretary of State Mike Pompeo delivered a sobering assessment of the prospects of the Trump administration’s long-awaited Middle East peace plan in a closed-door meeting with Jewish leaders, saying “one might argue” that the plan is “unexecutable” and it might not “gain traction.” He expressed his hope that the deal isn’t simply dismissed out of hand.\n\n“It may be rejected. Could be in the end, folks will say, ‘It’s not particularly original, it doesn’t particularly work for me,’ that is, ‘It’s got two good things and nine bad things, I’m out,’ ” Pompeo said in an audio recording of the private meeting obtained by The Washington Post.\n\n“The big question is can we get enough space that we can have a real conversation about how to build this out,” he said.\n\nThe remarks are the most unvarnished comments to date from a U.S. official about President Trump’s “deal of the century,” an effort to resolve the intractable Israeli-Palestinian dispute he has entrusted to his son-in-law, Jared Kushner, and former lawyer Jason Greenblatt.\n\nThe unveiling of the plan has been repeatedly delayed, a point Pompeo noted.\n\n“This has taken us longer to roll out our plan than I had originally thought it might — to put it lightly,” he said at a meeting on Tuesday of the Conference of Presidents of Major American Jewish Organizations, a New York-based group that addresses concerns of the Jewish community.\n\nIn trying to manage expectations, he said there are “no guarantees that we’re the ones that unlock it,” he said, referring to the frozen conflict. “I hope everyone will engage in a serious way.”\n\nHe also recognized the popular notion that the agreement will be one-sided in favor of the Israeli government. “I get why people think this is going to be a deal that only the Israelis could love,” he said. “I understand the perception of that. I hope everyone will just give the space to listen and let it settle in a little bit.”\n\nSince the U.S. president announced plans to solve the decades-old conflict, the United States has taken actions vehemently opposed by the Palestinians, including recognizing Jerusalem as Israel’s capital without a final-status agreement, cutting funding to the Palestinian Authority and the U.N. refugee agency that serves it, forcing its diplomatic office in Washington to close, and recognizing Israeli sovereignty over the Golan Heights.\n\nTwo attendees said they left with the impression that Pompeo was not optimistic the plan would succeed. “He was not in any way confident that the process would lead to a successful conclusion,” said one of the attendees, both of whom spoke on the condition of anonymity because the terms of the meeting were off the record.\n\nElan Carr, the State Department’s special envoy to combat anti-Semitism who also attended the meeting, expressed a different view, saying he thought Pompeo “provided a hopeful assessment over the prospect of a peace deal between Israel and the Palestinians.”\n\n“It was an excellent briefing that was very well received by the conference,” he said in a statement offered by the State Department.\n\nAaron David Miller, a former negotiator and analyst on Middle East issues for both Republican and Democratic administrations, said the remarks were “the most revealing and real assessment of the plan that I’ve heard so far.”\n\n“The fact that Pompeo so easily conceded the perception — and likely the reality — that the plan was strongly structured and tilted toward the Israelis is striking,” Miller said.\n\nThe CEO of the group that hosted the event, Malcolm Hoenlein, said he thought Pompeo’s remarks reflected his awareness of allegations of a pro-Israel bias but not the secretary’s own view of the plan. “He was saying it’s too easy to fall into the trap of these negative assessments,” he said.\n\nPompeo, unlike previous secretaries of state, is not overseeing the peace effort, but he told the group he is kept closely abreast of the proposal, including a game plan for what to do if Israel proceeds to annex territory in the West Bank. “I have seen what I believe are all of the details of what it is we are going to roll out,” he said.\n\nKushner, a real estate scion from New Jersey, and Greenblatt, the former chief legal officer for Trump and the Trump Organization, have led the initiative since the president took power. The two men, both practicing Orthodox Jews, did not come in with political experience but have shared a long interest in and connection to Israel.\n\nPompeo said the administration never believed achieving a lasting peace agreement would be easy. “We’re under no illusions [that] we’re going to show up with this thing and everyone’s going to say, ‘Tell me where to go for the signing ceremony,’ ” he said. “It doesn’t work that way.”\n\nIf the peace plan had appeared to be an uphill battle when Pompeo spoke Tuesday night, it hit another significant hurdle just a day later as Israeli Prime Minister Benjamin Netanyahu failed to form a governing coalition and Israel’s parliament voted to dissolve itself, sending the country back to elections in September.\n\nNow, if the White House wants to avoid rolling out a peace plan during a sensitive election campaign period for Netanyahu, it will have to wait until at least November, when a new Israeli government is expected to be formed. By that time, the Trump administration will be stepping up its own reelection campaign.\n\nPompeo said the State Department had given “quite a bit of consideration” to what it would do if the plan “doesn’t gain traction.”\n\n“I don’t want to call it failing,” he said. “Call it whatever. I fail a lot, so it’s not about not using a word like that.”\n\nThe contingency planning includes how to respond if the Israeli government decides to annex territory in the West Bank, a move many believe would be a final death knell to a two-state solution.\n\nAs part of his election campaign, Netanyahu pledged to annex Israeli settlements in the West Bank if he won, a move considered illegal by much of the international community. He also may face pressure from right-wing coalition partners to take advantage of the remaining time before the next U.S. election.\n\nA peace plan that lays down Israel’s right to sovereignty over certain areas of the West Bank could bolster calls from those pushing for annexation.\n\nIf Israel did go ahead with annexation, the administration would then consider “what would be the best ways to achieve the outcomes that we think are in America and Israel’s best interests,” Pompeo said.\n\nAfter a participant asked whether there was any effort to bring the Palestinians on board, Pompeo responded that “everyone will find something to hate about the proposal” but that everyone, including the Palestinians, “will find something that they say that’s something to build upon.”\n\nPalestinian officials see the White House plan as inevitably biased against them. In a speech broadcast on Palestine TV recently, Palestinian Authority President Mahmoud Abbas said that both the “deal of the century” and the Trump administration's upcoming economic summit for the Palestinians in Bahrain could “go to hell.”\n\nThe goal of the Bahrain summit is to drum up support for the economic component of the administration’s peace plan without getting bogged down in the more contentious territorial issues.\n\nAbbas has said Palestinian officials will boycott the summit.\n\nPompeo said if Kuwait signs up, all the Persian Gulf states will be represented in Bahrain “to at least come to listen.” He said it was hard to expect gulf nations to come out in “full-throated support” for the process when they haven’t seen the whole plan.\n\nCritics of the Trump administration’s approach have picked up on the fact that the economic summit is not being held in tandem with political discussions.\n\n“You can’t do serious economic development without resolving the security and political issues that allow investors and internal economic growth and employment,” Miller said.\n\nMorris reported from Jerusalem."}, {"link": "https://www.washingtonpost.com/world/asia_pacific/purged-not-purged-leading-north-korean-official-re-emerges-in-public/2019/06/03/fbb55d02-85f6-11e9-98c1-e945ae5db8fb_story.html", "published": "2019-06-03T14:16:00", "title": "Purged? Not purged. Leading North Korean official reemerges in public.", "text": "People watch a TV screen showing an image of senior North Korean official Kim Yong Chol attending a musical performance in North Korea during a news program at the Seoul Railway Station on June 3. (Ahn Young-Joon/AP)\n\nA senior official who was reported last week as being the victim of a purge in North Korea has reappeared in public sitting not far from the country’s leader, Kim Jong Un.\n\nThe reemergence of Kim Yong Chol, a powerful, hard-line former spy chief and Secretary of State Mike Pompeo’s counterpart in talks with the United States, underlines how opaque the North Korean regime remains to the outside world.\n\nIt also is a reminder of how little outsiders know about how Kim Jong Un reacted to the breakdown of his recent summit with President Trump.\n\nRumors of Kim Yong Chol’s demotion have circulated since last month, when he did not accompany Kim Jong Un to Vladivostok to meet Russian President Vladimir Putin, an unusual occurrence for a man who is normally not far from his leader’s side on international trips.\n\nSouth Korean newspaper Chosun Ilbo reported Friday that he had been sentenced to hard labor and ideological reeducation as punishment for the failure of the summit with Trump in Hanoi in late February.\n\nThe newspaper also reported that Kim Hyok Chol, the counterpart of U.S. envoy Stephen Biegun in pre-summit negotiations, had been executed, although many diplomats and experts expressed caution or outright skepticism about that claim.\n\nNow, North Korean state media have shown Kim Yong Chol, sitting five seats down from Kim Jong Un at an event where the wives of military officers gave an artistic performance. While everyone else was applauding, Kim Yong Chol was shown with his hands on his face, although he was easily recognizable.\n\n[Was a North Korean official executed? Mystery may cloud new talks with the U.S.]\n\nRachel Minyoung Lee, an analyst with the North Korea-focused website NK Pro, said Kim Yong Chol was named among the attendees as his position in the Politburo would merit, implying no formal demotion in rank — 10th among the 12 officials listed in order of seniority.\n\nBut Lee said the fact that Kim Yong Chol did not accompany his leader to Russia — and that he earlier reportedly had been replaced as head of the United Front Department, a ruling-party body in charge of ties with South Korea — implied “a demotion in a way.”\n\nThe idea that Kim Yong Chol had been purged also appeared to be contradicted by him being listed as having been reelected to the Supreme People’s Assembly, the country’s rubber-stamp parliament, and to the State Affairs Commission, a key decision-making body, in mid-April, the NK News website, the sister site to NK Pro, pointed out.\n\nKim Hyok Chol, meanwhile, has not been seen in public since the Hanoi summit, although some experts say it would make little sense for Kim Jong Un to order his execution after going to great lengths to try to build up his own image as a global statesman.\n\nIf he imposed such a harsh punishment purely to have a scapegoat, no one within the regime would “dare engage in negotiations with the outside world anymore,” said Cheong Seong-chang of South Korea’s Sejong Institute. “It’s very unlikely for Kim to wield such an extreme punishment unless he has given up on talks with the United States.”\n\nCheong also said Kim Hyok Chol was seen on April 13, citing a source familiar with the matter.\n\n“It’s true that Kim Jong Un turns to purges and fear politics to solidify his absolute power,” he said. “But it is not sensible at all to conclude an official has been purged because of prolonged absence from the public eye, given how many of them turned out to have been temporary demotions or personnel shake-ups, especially when basing it on ‘North Korean sources,’ which are difficult to have confidence in.”\n\nBut the appearance of Kim Yong Chol was not the only surreal scene in the theater in Pyongyang over the weekend.\n\nWhat had Kim Yong Un and his entourage applauding so enthusiastically was a musical performance by the wives of military officers, in which they sang about how they “make every moment of their lives honorable with ardent yearning for the leader and boundless loyalty to him.”\n\nPieces included “Yearning,” as well as a chorus performance of “Our Leader Loved by People,” an accordion ensemble and chorus of “Our National Flag,” a chorus performance of “Ardent Desire,” an instrumental trio ensemble of “Beautiful Vapor Trail” and a national instrumental ensemble of “Our Socialism Is the Best in the World.”\n\nThe state-run Korean Central News Agency reported that “the performance was highly acclaimed by the audience for successfully showing that the defense line of the country is impregnable as long as there is a large unit of women revolutionaries who bear in mind the great trust and expectation of the Party Central Committee and add dynamism to the revolution with love and devotion.”\n\nDenyer reported from Hokkaido, Japan.\n\nRead more:\n\nAbsence of key North Korean negotiator at Russia summit offers glimmer of hope\n\nWhy a South Korean newspaper asked experts to look at photos of Kim Jong Un’s shoes\n\nTrump appears to contradict Bolton on North Korea, expresses ‘confidence’ in Kim\n\nToday’s coverage from Post correspondents around the world\n\nLike Washington Post World on Facebook and stay updated on foreign news"}]}}}